class Solution:
    def maxProfit(self, prices: List[int]) -> int:
        n = len(prices)
        NEG_INF = float("-inf")

        # 每一行对应一天；三列依次是：持有、今天卖出、今天休息
        dp = [[NEG_INF] * 3 for _ in range(n)]

        # 第 0 天
        dp[0][0] = -prices[0]  # 买入，付出 prices[0]
        dp[0][1] = NEG_INF     # 第 0 天不可能先持有、再卖出
        dp[0][2] = 0           # 什么都不做

        for i in range(1, n):
            # 1.继续持有；或者从昨天的休息状态买入
            dp[i][0] = max(
                dp[i - 1][0],
                dp[i - 1][2] - prices[i]
            )

            # 2.今天卖出：昨天必须持有币
            dp[i][1] = dp[i - 1][0] + prices[i]

            # 3.今天不持有也不卖：继续休息；或者昨天卖出、今天冷冻
            dp[i][2] = max(
                dp[i - 1][2],
                dp[i - 1][1]
            )

        # 最后不能以“仍持有币”作为最终交易利润
        return max(dp[n - 1][1], dp[n - 1][2])

# 抽屉	    第 i 天结束时是什么情况？	dp 里存什么？
# dp[i][0]	手里有币	               这种情况下，账上最多能剩多少钱
# dp[i][1]	今天刚把币卖了	            这种情况下，账上最多能剩多少钱
# dp[i][2]	手里没币，今天也没卖币	     这种情况下，账上最多能剩多少钱
# dp[0] = [-price[0],  -∞,       0]
#          持有         刚卖    休息
# dp[i] = [持有币时的最高利润, 今天卖出时的最高利润, 今天休息时的最高利润]

# 三、以后每天怎么填？
# 每个格子都问一句：要在今天结束时处于这个状态，昨天可能处于什么状态？

# 1. 今天结束时持有币：dp[i][0]
# dp[i][0] = max(    dp[i - 1][0],    dp[i - 1][2] - prices[i])
# 有两种来法：
# - 昨天就持有，今天继续拿着：dp[i - 1][0]。
# - 昨天已经休息，今天买入：dp[i - 1][2] - prices[i]。
# 不能从昨天刚卖出 dp[i - 1][1] 直接买入，因为今天是冷冻日。

# 2. 今天刚卖出：dp[i][1]
# dp[i][1] = dp[i - 1][0] + prices[i]
# 今天要卖，昨天就必须持有。今天收到 prices[i] 元，所以加上价格。

# 3. 今天休息：dp[i][2]
# dp[i][2] = max(    dp[i - 1][2],    dp[i - 1][1])
# 也有两种来法：
# - 昨天就在休息，今天继续休息。
# - 昨天刚卖出，今天执行冷冻期，利润保持不变

